sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events_cb.c
/**
  ******************************************************************************
  * @file    stm32wb05n_events_cb.c
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version V1.3.0
  * @date    06-Feb-2024
  * @brief   Event callbacks for external uC - STM32WB05N in network coprocessor 
  *          mode
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "compiler.h"
#include "stm32wb05n_events.h"

#include "stm32wb_conf.h"

/**
 * @brief The Disconnection Complete event occurs when a connection is
 *        terminated. The status parameter indicates if the disconnection was
 *        successful or not. The reason parameter indicates the reason for the
 *        disconnection if the disconnection was successful. If the
 *        disconnection was not successful, the value of the reason parameter
 *        can be ignored by the Host. For example, this can be the case if the
 *        Host has issued the Disconnect command and there was a parameter
 *        error, or the command was not presently allowed, or a
 *        Connection_Handle that didn't correspond to a connection was given.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection_Handle which was disconnected.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Reason Reason for disconnection. See Error Codes.
 * @retval None
 */
WEAK_FUNCTION(void hci_disconnection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Reason))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_disconnection_complete_event\r\n");
}
/**
 * @brief The Encryption Change event is used to indicate that the change of the
 *        encryption mode has been completed. The Connection_Handle will be a
 *        Connection_Handle for an ACL connection. The Encryption_Enabled event
 *        parameter specifies the new Encryption_Enabled parameter for the
 *        Connection_Handle specified by the Connection_Handle event parameter.
 *        This event will occur on both devices to notify the Hosts when
 *        Encryption has changed for the specified Connection_Handle between two
 *        devices. Note: This event shall not be generated if encryption is
 *        paused or resumed; during a role switch, for example. The meaning of
 *        the Encryption_Enabled parameter depends on whether the Host has
 *        indicated support for Secure Connections in the
 *        Secure_Connections_Host_Support parameter. When
 *        Secure_Connections_Host_Support is 'disabled' or the Connection_Handle
 *        refers to an LE link, the Controller shall only use Encryption_Enabled
 *        values 0x00 (OFF) and 0x01 (ON). (See Bluetooth Specification v.4.1,
 *        Vol. 2, Part E, 7.7.8)
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Encryption_Enabled Link Level Encryption.
 *        Values:
 *        - 0x00: Link Level Encryption OFF
 *        - 0x01: Link Level Encryption is ON with AES-CCM
 * @retval None
 */
WEAK_FUNCTION(void hci_encryption_change_event(uint8_t Status,
                                 uint16_t Connection_Handle,
                                 uint8_t Encryption_Enabled))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_encryption_change_event\r\n");
}
/**
 * @brief The Read Remote Version Information Complete event is used to indicate
 *        the completion of the process obtaining the version information of the
 *        remote Controller specified by the Connection_Handle event parameter.
 *        The Connection_Handle shall be for an ACL connection. The Version
 *        event parameter defines the specification version of the LE
 *        Controller. The Manufacturer_Name event parameter indicates the
 *        manufacturer of the remote Controller. The Subversion event parameter
 *        is controlled by the manufacturer and is implementation dependent. The
 *        Subversion event parameter defines the various revisions that each
 *        version of the Bluetooth hardware will go through as design processes
 *        change and errors are fixed. This allows the software to determine
 *        what Bluetooth hardware is being used and, if necessary, to work
 *        around various bugs in the hardware. When the Connection_Handle is
 *        associated with an LE-U logical link, the Version event parameter
 *        shall be Link Layer VersNr parameter, the Manufacturer_Name event
 *        parameter shall be the CompId parameter, and the Subversion event
 *        parameter shall be the SubVersNr parameter. (See Bluetooth
 *        Specification v.4.1, Vol. 2, Part E, 7.7.12)
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Version Version of the Current LMP in the remote Controller
 * @param Manufacturer_Name Manufacturer Name of the remote Controller
 * @param Subversion Subversion of the LMP in the remote Controller
 * @retval None
 */
WEAK_FUNCTION(void hci_read_remote_version_information_complete_event(uint8_t Status,
                                                        uint16_t Connection_Handle,
                                                        uint8_t Version,
                                                        uint16_t Manufacturer_Name,
                                                        uint16_t Subversion))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_read_remote_version_information_complete_event\r\n");
}
/**
 * @brief The Hardware Error event is used to indicate some implementation
 *        specific type of hardware failure for the controller. This event is
 *        used to notify the Host that a hardware failure has occurred in the
 *        Controller.
 * @param Hardware_Code Error code 0x01 and 0x02 are errors generally caused by
 *        hardware issue on the PCB; another possible cause is a slow crystal
 *        startup. In the latter case, the HS_STARTUP_TIME in the device
 *        configuration needs to be tuned. Error code 0x03 indicates an internal
 *        error of the protocol stack. This event with error code 0x04 is raised
 *        when a radio interrupt is served late. This usually happens when
 *        interrupts are disabled for too long time or when a Flash operation is
 *        performed (which can be also triggered by the Stack to store bonding
 *        information). Stack will try to recover the situation, so there is
 *        normally no need to reset the device. However this condition should be
 *        avoided as much as possible. Error code 0x05 is raised when an error
 *        happens during a TX transaction. After this event is received with
 *        error code 0x00, 0x01, 0x02 or 0x03, it is recommended to force a
 *        device reset.
 *        Values:
 *        - 0x00: Generic HW error
 *        - 0x01: Radio state error
 *        - 0x02: Timer overrun error
 *        - 0x03: Internal queue overflow error
 *        - 0x04: Late Radio ISR
 *        - 0x05: TX Error
 * @retval None
 */
WEAK_FUNCTION(void hci_hardware_error_event(uint8_t Hardware_Code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_hardware_error_event\r\n");
}
/**
 * @brief The Number Of Completed Packets event is used by the Controller to
 *        indicate to the Host how many HCI Data Packets have been completed
 *        (transmitted or flushed) for each Connection_Handle since the previous
 *        Number Of Completed Packets event was sent to the Host. This means
 *        that the corresponding buffer space has been freed in the Controller.
 *        Based on this information, and the HC_Total_Num_ACL_Data_Packets and
 *        HC_Total_Num_Synchronous_- Data_Packets return parameter of the
 *        Read_Buffer_Size command, the Host can determine for which
 *        Connection_Handles the following HCI Data Packets should be sent to
 *        the Controller. The Number Of Completed Packets event must not be sent
 *        before the corresponding Connection Complete event. While the
 *        Controller has HCI data packets in its buffer, it must keep sending
 *        the Number Of Completed Packets event to the Host at least
 *        periodically, until it finally reports that all the pending ACL Data
 *        Packets have been transmitted or flushed.
 * @param Number_of_Handles The number of Connection_Handles and
 *        Num_HCI_Data_Packets parameters pairs contained in this event
 * @param Handle_Packets_Pair_Entry See @ref Handle_Packets_Pair_Entry_t
 * @retval None
 */
WEAK_FUNCTION(void hci_number_of_completed_packets_event(uint8_t Number_of_Handles,
                                           Handle_Packets_Pair_Entry_t Handle_Packets_Pair_Entry[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_number_of_completed_packets_event\r\n");
}
/**
 * @brief This event is used to indicate that the Controller's data buffers have
 *        been overflowed. This can occur if the Host has sent more packets than
 *        allowed. The Link_Type parameter is used to indicate that the overflow
 *        was caused by ACL data.
 * @param Link_Type On which type of channel overflow has occurred.
 *        Values:
 *        - 0x01: ACL Buffer Overflow
 * @retval None
 */
WEAK_FUNCTION(void hci_data_buffer_overflow_event(uint8_t Link_Type))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_data_buffer_overflow_event\r\n");
}
/**
 * @brief The Encryption Key Refresh Complete event is used to indicate to the
 *        Host that the encryption key was refreshed on the given
 *        Connection_Handle any time encryption is paused and then resumed. If
 *        the Encryption Key Refresh Complete event was generated due to an
 *        encryption pause and resume operation embedded within a change
 *        connection link key procedure, the Encryption Key Refresh Complete
 *        event shall be sent prior to the Change Connection Link Key Complete
 *        event. If the Encryption Key Refresh Complete event was generated due
 *        to an encryption pause and resume operation embedded within a role
 *        switch procedure, the Encryption Key Refresh Complete event shall be
 *        sent prior to the Role Change event.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval None
 */
WEAK_FUNCTION(void hci_encryption_key_refresh_complete_event(uint8_t Status,
                                               uint16_t Connection_Handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_encryption_key_refresh_complete_event\r\n");
}
/**
 * @brief The HCI_Authenticated_Payload_Timeout_Expired event is used to
 *        indicate that a packet containing a valid MIC on the Connection_Handle
 *        was not received within the authenticatedPayloadTO. Note: A Host may
 *        choose to disconnect the link when this occurs.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval None
 */
WEAK_FUNCTION(void hci_authenticated_payload_timeout_expired_event(uint16_t Connection_Handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_authenticated_payload_timeout_expired_event\r\n");
}
/**
 * @brief Event used to receive asynchronous data from the controller on a link.
 *
 * @note The event is available only when "Link Layer only" mode is active.
 *
 * @param      Connection_Handle  Connection handle. Range: 0x0000-0x0EFF (0x0F00 - 0x0FFF Reserved for future use)
 * @param      PB_Flag            Packet boundary flag
 * @param      BC_Flag            Broadcast flag
 * @param      Data_Length        Length of PDU data in octets.
 * @param[in]  PDU_Data           PDU data pointer
 *
 * @return  Error code
 */
tBleStatus hci_rx_acl_data_event(uint16_t Connection_Handle,
                                 uint8_t  PB_Flag,
                                 uint8_t  BC_Flag,
                                 uint16_t  Data_Length,
                                 uint8_t*  PDU_Data)
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_rx_acl_data_event\r\n");
  return 0;
}
/**
 * @brief Callback used to receive isochronous data from the Controller.
 *
 * @param      Connection_Handle    Connection handle. Range: 0x0000-0x0EFF (0x0F00 - 0x0FFF Reserved for future use)
 * @param      PB_Flag              Packet boundary flag
 * @param      TS_Flag              Timestamp flag. Set if the ISO_Data_Load field contains a Time_Stamp field.
 * @param      ISO_Data_Load_Length Length of ISO_Data_Load in octets.
 * @param[in]  ISO_Data_Load        The format of the ISO_Data_Load is described in Core v5.3 Vol. 4, part E, section 5.4.5
 *
 * @return  Error code
 */
tBleStatus hci_le_rx_iso_data_event(uint16_t Connection_Handle,
                                    uint8_t  PB_Flag,
                                    uint8_t TS_Flag,
                                    uint16_t ISO_Data_Load_Length,
                                    uint8_t *ISO_Data_Load)
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_rx_iso_data_event\r\n");
  return 0;
}
/**
 * @}
 */

/**
 *@addtogroup HAL_LL HAL/LL
 *@brief HAL and proprietary LL API layer.
 *@{
 */
/**
 *@defgroup ACI_HAL_events ACI HAL events
 *@brief Events for HAL and proprietary LL.
 *@{
 */
/* ACI HAL events */
/**
 * @brief This event inform the application that the network coprocessor has
 *        been reset. If the reason code is a system crash, a following event
 *        @ref aci_blue_crash_info_event will provide more information regarding
 *        the system crash details.
 * @param Reason_Code Reason code describing why device was reset and in which
 *        mode is operating (Updater or Normal mode)
 *        Values:
 *        - 0x01: Firmware started properly
 *        - 0x02: Updater mode entered with ACI command
 *        - 0x03: Updater mode entered due to bad Blue Flag
 *        - 0x04: Updater mode entered due to boot pin
 *        - 0x05: System reset due to watchdog
 *        - 0x06: System reset due to lockup
 *        - 0x07: System reset due to brownout reset
 *        - 0x08: System reset due to crash
 *        - 0x09: System reset due to ECC error
 * @retval None
 */
WEAK_FUNCTION(void aci_blue_initialized_event(uint8_t Reason_Code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_blue_initialized_event\r\n");
}
/**
 * @brief This event is given to the application after the @ref
 *        aci_blue_initialized_event when a system crash is detected. This
 *        events returns system crash information for debugging purposes.
 *        Information reported are useful to understand the root cause of the
 *        crash.
 * @param Crash_Type Crash type
 *        Values:
 *        - 0x00: Assert failed
 *        - 0x01: NMI fault
 *        - 0x02: Hard fault
 * @param SP Stack pointer
 * @param R0 Register R0
 * @param R1 Register R1
 * @param R2 Register R2
 * @param R3 Register R3
 * @param R12 Register R12
 * @param LR Link register
 * @param PC Program counter where crash occurred
 * @param xPSR xPSR register
 * @param Debug_Data_Length Length of Debug_Data field
 * @param Debug_Data Debug data
 * @retval None
 */
WEAK_FUNCTION(void aci_blue_crash_info_event(uint8_t Crash_Type,
                               uint32_t SP,
                               uint32_t R0,
                               uint32_t R1,
                               uint32_t R2,
                               uint32_t R3,
                               uint32_t R12,
                               uint32_t LR,
                               uint32_t PC,
                               uint32_t xPSR,
                               uint8_t Debug_Data_Length,
                               uint8_t Debug_Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_blue_crash_info_event\r\n");
}
/**
 * @brief This event is generated when the device completes a radio activity and
 *        provide information when a new radio activity will be performed.
 *        Information provided includes type of radio activity and absolute time
 *        in system ticks when a new radio activity is schedule, if any.
 *        Application can use this information to schedule user activities
 *        synchronous to selected radio activities. A command @ref
 *        aci_hal_set_radio_activity_mask is provided to enable radio activity
 *        events of user interests, by default no events are enabled. User
 *        should take into account that enabling radio events in application
 *        with intense radio activity could lead to a fairly high rate of events
 *        generated. Application use cases includes synchronizing notification
 *        with connection interval, switching  antenna at the end of advertising
 *        or performing flash erase operation while radio is idle.
 * @param Last_State Completed radio events
 *        Values:
 *        - 0x00: Idle
 *        - 0x01: Advertising
 *        - 0x02: Connection event peripheral
 *        - 0x03: Scanning
 *        - 0x04: Connection request
 *        - 0x05: Connection event central
 *        - 0x06: TX test mode
 *        - 0x07: RX test mode
 * @param Next_State Incoming radio events
 *        Values:
 *        - 0x00: Idle
 *        - 0x01: Advertising
 *        - 0x02: Connection event peripheral
 *        - 0x03: Scanning
 *        - 0x04: Connection request
 *        - 0x05: Connection event central
 *        - 0x06: TX test mode
 *        - 0x07: RX test mode
 * @param Next_State_SysTime 32bit absolute current time expressed in internal
 *        time units.
 * @retval None
 */
WEAK_FUNCTION(void aci_hal_end_of_radio_activity_event(uint8_t Last_State,
                                         uint8_t Next_State,
                                         uint32_t Next_State_SysTime))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_hal_end_of_radio_activity_event\r\n");
}
/**
 * @brief This event is generated to report firmware error information.
 * @param FW_Error_Type Code identifying the type of error that has occurred in
 *        Bluetooth stack.  0x01: L2CAP layer failed recombining a PDU; 0x02:
 *        GATT layer received an unexpteced response (protocol violation); 0x03:
 *        GATT layer received an unexpteced request (protocol violation); 0x04:
 *        No space to store info GATT database info in NVM (database clean-up
 *        needed or bonding entries to be removed); 0x05: No space to store
 *        bonding info in NVM  (database clean-up  needed or bonding entries to
 *        be removed); 0x06: Link Layer scheduler failed to reschedule slots for
 *        too many times (a system reset is recommended; 0x07: Out of memory
 *        resources for isochronous channels; 0x08: Error in programming timer
 *        for CTE reception functionality.
 *        Values:
 *        - 0x01: HAL_FW_L2CAP_RECOMBINATION_ERROR
 *        - 0x02: HAL_FW_GATT_UNEXPECTED_RESPONSE_ERROR
 *        - 0x03: HAL_FW_GATT_SEQUENTIAL_PROTOCOL_ERROR
 *        - 0x04: HAL_FW_BONDING_DB_FULL_GATTSERVICE_ERROR
 *        - 0x05: HAL_FW_BONDING_DB_FULL_PAIRING_ERROR
 *        - 0x06: HAL_FW_SCHEDULER_OVERRUN_ERROR
 *        - 0x07: HAL_FW_MEMBUF_NOT_AVAILABLE
 *        - 0x08: HAL_FW_CTE_TIMER_PROGRAM_ERROR
 * @param Data_Length Length of Data in octets
 * @param Data The error event info. If FW_Error_Type is 0x01, 0x02 or 0x03,
 *        this parameter contains the connection handle where the abnormal
 *        condition has occurred.
 * @retval None
 */
WEAK_FUNCTION(void aci_hal_fw_error_event(uint8_t FW_Error_Type,
                            uint8_t Data_Length,
                            uint8_t Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_hal_fw_error_event\r\n");
}
/**
 * @brief This event is generated when the amount of transmitted test packets
 *        specified with aci_hal_transmitter_test_packets() has been reached.
 * @param Number_Of_Packets The number of test packets actually transmitted.
 * @retval None
 */
WEAK_FUNCTION(void aci_hal_le_test_end_event(uint16_t Number_Of_Packets))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_hal_le_test_end_event\r\n");
}
/**
 * @}
 */

