sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events_cb.c
WEAK_FUNCTION(void aci_gap_pairing_event(uint16_t Connection_Handle,
                                      uint8_t Bonded))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gap_pairing_event\r\n");
}
/**
 * @brief This event is generated when the central responds to the connection
 *        update request packet with a connection update response packet.
 * @param Connection_Handle Connection handle referring to the COS Channel where
 *        the Disconnection has been received.
 * @param Result
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_connection_update_resp_event(uint16_t Connection_Handle,
                                            uint16_t Result))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_connection_update_resp_event\r\n");
}
/**
 * @brief This event is generated when the central does not respond to the
 *        connection update request packet with a connection update response
 *        packet or a command reject packet within 30 seconds.
 * @param Connection_Handle Handle of the connection related to this L2CAP
 *        procedure.
 * @param Data_Length Length of following data
 * @param Data
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_proc_timeout_event(uint16_t Connection_Handle,
                                  uint8_t Data_Length,
                                  uint8_t Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_proc_timeout_event\r\n");
}
/**
 * @brief The event is given by the L2CAP layer when a connection update request
 *        is received from the peripheral. The upper layer which receives this
 *        event has to respond by sending a @ref
 *        aci_l2cap_connection_parameter_update_resp command.
 * @param Connection_Handle Handle of the connection related to this L2CAP
 *        procedure.
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param L2CAP_Length Length of the L2CAP connection update request.
 * @param Connection_Interval_Min Minimum value for the connection event
 *        interval. This shall be less than or equal to Connection_Interval_Max.
 *        Time = N * 1.25 msec.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Connection_Interval_Max Maximum value for the connection event
 *        interval. This shall be greater than or equal to
 *        Connection_Interval_Min. Time = N * 1.25 msec.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Max_Latency Maximum Peripheral latency for the connection in number of
 *        connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Timeout_Multiplier Defines connection timeout parameter in the
 *        following manner: Timeout Multiplier * 10ms.
 *        Values:
 *        - 10 (100 ms)  ... 3200 (32000 ms) 
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_connection_update_req_event(uint16_t Connection_Handle,
                                           uint8_t Identifier,
                                           uint16_t L2CAP_Length,
                                           uint16_t Connection_Interval_Min,
                                           uint16_t Connection_Interval_Max,
                                           uint16_t Max_Latency,
                                           uint16_t Timeout_Multiplier))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_connection_update_req_event\r\n");
}
/**
 * @brief Event raised when an L2CAP channel using LE Credit Based Flow Control
 *        mode is terminated.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_cos_disconnection_complete_event(uint16_t Connection_Handle,
                                                uint16_t CID))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_cos_disconnection_complete_event\r\n");
}
/**
 * @brief Event raised when an L2CAP_FLOW_CONTROL_CREDIT_IND is received from
 *        the peer, which means that it is capable of receiving additional
 *        K-frames (for example after it has processed one or more K-frames) in
 *        LE Credit Based Flow Control.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param TX_Credits The number of additional k-frames that the peer's L2CAP
 *        layer entity can receive.
 * @param TX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently send to the peer.
 *        Values:
 *        - 1 ... 65535
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_cos_flow_control_credit_event(uint16_t Connection_Handle,
                                             uint16_t CID,
                                             uint16_t TX_Credits,
                                             uint16_t TX_Credit_Balance))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_cos_flow_control_credit_event\r\n");
}
/**
 * @brief Event raised when an SDU to be transmitted has been processed by the
 *        local L2CAP layer entity.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param SDU_Length
 * @param TX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently send to the peer.
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_cos_sdu_data_tx_event(uint16_t Connection_Handle,
                                     uint16_t CID,
                                     uint16_t SDU_Length,
                                     uint16_t TX_Credit_Balance))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_cos_sdu_data_tx_event\r\n");
}
/**
 * @brief Event raised when an SDU has been received.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param RX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently receive from the peer. If automatic management of
 *        credits is enabled, this number is automatically changed after the SDU
 *        is extracted.
 * @param SDU_Length
 * @param SDU_Data
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_cos_sdu_data_rx_nwk_event(uint16_t Connection_Handle,
                                         uint16_t CID,
                                         uint16_t RX_Credit_Balance,
                                         uint16_t SDU_Length,
                                         uint8_t SDU_Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_cos_sdu_data_rx_nwk_event\r\n");
}
/**
 * @brief Event generated when receiving an L2CAP_CREDIT_BASED_RECONFIGURE_REQ
 *        or an L2CAP_CREDIT_BASED_RECONFIGURE_RSP, to reconfigure one or more
 *        (up to 5) L2CAP Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Event_Type
 *        Values:
 *        - 0x00: L2CAP_ECFC_RECONFIGURE_REQ
 *        - 0x01: L2CAP_ECFC_RECONFIGURE_RESP
 * @param Result Result of the connection request if Event_Type is
 *        L2CAP_ECFC_CONN_RESP. To be ignored if Event_Type is
 *        L2CAP_ECFC_CONN_REQ.
 *        Values:
 *        - 0x0000: L2CAP_RECONFIG_SUCCESSFUL
 *        - 0x0001: L2CAP_RECONFIG_FAIL_MTU_REDUCTION_NOT_ALLOWED
 *        - 0x0002: L2CAP_RECONFIG_FAIL_MPS_REDUCTION_NOT_ALLOWED
 *        - 0x0003: L2CAP_RECONFIG_FAIL_INVALID_CID
 *        - 0x0004: L2CAP_RECONFIG_FAIL_UNACCEPTABLE_PARAMETERS
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel after successful reconfiguration.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel after successful
 *        reconfiguration.
 *        Values:
 *        - 64 ... 65535
 * @param CID_Count Number of Channels that are going to be created.
 *        Values:
 *        - 0x01 ... 0x05
 * @param Local_CID Array of up to 5 two-octet values that represent the local
 *        channel endpoints identifying the EATT channels to be reconfigured.
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_cos_reconfiguration_event(uint16_t Connection_Handle,
                                         uint8_t Event_Type,
                                         uint16_t Result,
                                         uint8_t Identifier,
                                         uint16_t Peer_MTU,
                                         uint16_t Peer_MPS,
                                         uint8_t CID_Count,
                                         uint16_t Local_CID[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_cos_reconfiguration_event\r\n");
}
/**
 * @brief This event is generated when the central rejects a L2CAP request.
 * @param Connection_Handle Handle identifying the connection.
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param Reason Reason
 * @param Data_Length Length of following data
 * @param Data Data field associated with Reason
 * @retval None
 */
WEAK_FUNCTION(void aci_l2cap_command_reject_event(uint16_t Connection_Handle,
                                    uint8_t Identifier,
                                    uint16_t Reason,
                                    uint8_t Data_Length,
                                    uint8_t Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_command_reject_event\r\n");
}
/* aci_l2cap_cos_connection_req_event */
/* Event len: 2 + 1 + 1 + 2 + 2 + 2 + 2 + 1 */
/**
 * @brief Event generated when a request is received from the peer to create one
 *        L2CAP Credit Based Flow Control channel or one or more (up to 5) L2CAP
 *        Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Channel_Type Type of channel: LE Credit Based Flow Control Mode or
 *        Enhanced Credit Based Flow Control Mode.
 *        Values:
 *        - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 *        - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param SPSM Simplified Protocol/Service Multiplexer
 *        Values:
 *        - 0x0001 ... 0x00FF
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Initial_Credits The number of K-frames that can be sent to the L2CAP
 *        layer entity of the peer device as soon as the L2CAP channel is
 *        established.
 * @param CID_Count
 * @retval None
 */

