sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events_cb.c
WEAK_FUNCTION(void aci_l2cap_cos_connection_req_event(uint16_t Connection_Handle,
                                                        uint8_t Channel_Type,
                                                        uint8_t Identifier,
                                                        uint16_t SPSM,
                                                        uint16_t Peer_MTU,
                                                        uint16_t Peer_MPS,
                                                        uint16_t Initial_Credits,
                                                        uint8_t CID_Count))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_cos_connection_req_event\r\n");
}
/* aci_l2cap_cos_connection_resp_event */
/* Event len: 2 + 1 + 2 + 2 + 2 + 2 + 1 + rp0->CID_Count * (sizeof(uint16_t)) */
/**
 * @brief Event generated when a response is received from the peer to create
 *        one L2CAP Credit Based Flow Control channel or one or more (up to 5)
 *        L2CAP Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Channel_Type Type of channel: LE Credit Based Flow Control Mode or
 *        Enhanced Credit Based Flow Control Mode.
 *        Values:
 *        - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 *        - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Initial_Credits The number of K-frames that can be sent to the L2CAP
 *        layer entity of the peer device as soon as the L2CAP channel is
 *        established.
 * @param Result Outcome of the connetion request.
 *        Values:
 *        - 0x0000: L2CAP_CONN_SUCCESSFUL
 *        - 0x0002: L2CAP_CONN_FAIL_SPSM_NOT_SUPPORTED
 *        - 0x0004: L2CAP_CONN_FAIL_INSUFFICIENT_RESOURCES
 *        - 0x0005: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHENTICATION
 *        - 0x0006: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHORIZATION
 *        - 0x0007: L2CAP_CONN_FAIL_KEY_SIZE_TOO_SHORT
 *        - 0x0008: L2CAP_CONN_FAIL_INSUFFICIENT_ENCRYPTION
 *        - 0x0009: L2CAP_CONN_FAIL_INVALID_SOURCE_CID
 *        - 0x000A: L2CAP_CONN_FAIL_SOURCE_CID_ALREADY_ALLOCATED
 *        - 0x000B: L2CAP_CONN_FAIL_UNACCEPTABLE_PARAMETERS
 *        - 0x000C: L2CAP_CONN_FAIL_INVALID_PARAMETERS
 *        - 0x000D: L2CAP_CONN_FAIL_NO_INFO
 *        - 0x000E: L2CAP_CONN_FAIL_AUTHENTICATION_PENDING
 *        - 0x000F: L2CAP_CONN_FAIL_AUTHORIZATION_PENDING
 * @param CID_Count Number of channels to be created which are present in the
 *        L2CAP Credit Based Connection Request. The effective number of
 *        channels that will be opened can be less than this value (see
 *        Local_CID) .
 *        Values:
 *        - 0x01 ... 0x05
 * @param CID Array of up to 5 two-octet values that represent the local channel
 *        endpoints.
 * @retval None
 */

WEAK_FUNCTION(void aci_l2cap_cos_connection_resp_event(uint16_t Connection_Handle,
                                              uint8_t Channel_Type,
                                              uint16_t Peer_MTU,
                                              uint16_t Peer_MPS,
                                              uint16_t Initial_Credits,
                                              uint16_t Result,
                                              uint8_t CID_Count,
                                              uint16_t CID[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_l2cap_cos_connection_resp_event\r\n");
}
/**
 * @brief This event is generated to the application by the GATT server when a
 *        client modifies any attribute on the server, as consequence of one of
 *        the following GATT procedures: - write without response - signed write
 *        without response - write characteristic value - write long
 *        characteristic value - reliable write.
 * @param Connection_Handle The connection handle which modified the attribute.
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attr_Handle Handle of the attribute that was modified.
 * @param Attr_Data_Length Length of Attr_Data in octets
 * @param Attr_Data A concatenation of Handle, Length and Values for each of the
 *        attributes being notified.
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_srv_attribute_modified_event(uint16_t Connection_Handle,
                                           uint16_t CID,
                                           uint16_t Attr_Handle,
                                           uint16_t Attr_Data_Length,
                                           uint8_t Attr_Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_srv_attribute_modified_event\r\n");
}
/**
 * @brief This event is generated by the client/server to the application on a
 *        GATT timeout (30 seconds). This is a critical event that should not
 *        happen during normal operating conditions. It is an indication of
 *        either a major disruption in the communication link or a mistake in
 *        the application which does not provide a reply to GATT procedures.
 *        After this event, the GATT channel is closed and no more GATT
 *        communication can be performed. The applications is exptected to issue
 *        an @ref aci_gap_terminate to disconnect from the peer device.
 * @param Connection_Handle Connection handle on which the GATT procedure has
 *        timed out
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_proc_timeout_event(uint16_t Connection_Handle,
                                 uint16_t CID))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_proc_timeout_event\r\n");
}
/**
 * @brief This event is generated in response to an Exchange MTU request (local
 *        or from the peer), which can happen only on an unenhaced ATT bearer.
 *        See aci_gatt_clt_exchange_config().
 * @param Connection_Handle Connection handle related to the response
 * @param MTU ATT_MTU value agreed between server and client. This is the
 *        minimum of the Client Rx MTU and the Server Rx MTU.
 * @retval None
 */
WEAK_FUNCTION(void aci_att_exchange_mtu_resp_event(uint16_t Connection_Handle,
                                     uint16_t MTU))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_exchange_mtu_resp_event\r\n");
}
/**
 * @brief This event is generated in response to a Find Information Request
 *        during a discovery procedure for all the characteristic descriptors.
 *        See aci_gatt_clt_disc_all_char_desc() and Find Information Response in
 *        Bluetooth Core spec.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Format Format of the hanndle-uuid pairs
 * @param Event_Data_Length Length of Handle_UUID_Pair in octets
 * @param Handle_UUID_Pair A sequence of handle-uuid pairs. if format=1, each
 *        pair is:[2 octets for handle, 2 octets for UUIDs], if format=2, each
 *        pair is:[2 octets for handle, 16 octets for UUIDs]
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_find_info_resp_event(uint16_t Connection_Handle,
                                      uint16_t CID,
                                      uint8_t Format,
                                      uint16_t Event_Data_Length,
                                      uint8_t Handle_UUID_Pair[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_find_info_resp_event\r\n");
}
/**
 * @brief This event is generated during a "discover service by UUID" procedure.
 *        See aci_gatt_clt_disc_primary_service_by_uuid().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Num_of_Handle_Pair Number of attribute, group handle pairs
 * @param Attribute_Group_Handle_Pair See @ref Attribute_Group_Handle_Pair_t
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_find_by_type_value_resp_event(uint16_t Connection_Handle,
                                               uint16_t CID,
                                               uint8_t Num_of_Handle_Pair,
                                               Attribute_Group_Handle_Pair_t Attribute_Group_Handle_Pair[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_find_by_type_value_resp_event\r\n");
}
/**
 * @brief This event is generated in response to a ATT_READ_BY_TYPE_REQ, during
 *        a "find included service" procedure or a "discover all
 *        characteristics" procedure. See aci_gatt_clt_find_included_services()
 *        and aci_gatt_clt_disc_all_char_of_service().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Handle_Value_Pair_Length The size of each attribute handle-value pair
 * @param Data_Length Length of Handle_Value_Pair_Data in octets
 * @param Handle_Value_Pair_Data Attribute Data List as defined in Bluetooth
 *        Core v4.1 spec. A sequence of handle-value pairs: [2 octets for
 *        Attribute Handle, (Handle_Value_Pair_Length - 2 octets) for Attribute
 *        Value]
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_read_by_type_resp_event(uint16_t Connection_Handle,
                                         uint16_t CID,
                                         uint8_t Handle_Value_Pair_Length,
                                         uint16_t Data_Length,
                                         uint8_t Handle_Value_Pair_Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_read_by_type_resp_event\r\n");
}
/**
 * @brief This event is generated in response to a Read Request. See
 *        aci_gatt_clt_read().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Event_Data_Length Length of following data
 * @param Attribute_Value The value of the attribute.
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_read_resp_event(uint16_t Connection_Handle,
                                 uint16_t CID,
                                 uint16_t Event_Data_Length,
                                 uint8_t Attribute_Value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_read_resp_event\r\n");
}
/**
 * @brief This event can be generated during a read long characteristic value
 *        procedure. See aci_gatt_clt_read_long().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Event_Data_Length Length of following data
 * @param Attribute_Value Part of the attribute value.
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_read_blob_resp_event(uint16_t Connection_Handle,
                                      uint16_t CID,
                                      uint16_t Event_Data_Length,
                                      uint8_t Attribute_Value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_read_blob_resp_event\r\n");
}
/**
 * @brief This event is generated in response to a Read Multiple Request. See
 *        aci_gatt_clt_read_multiple_char_value().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Event_Data_Length Length of following data
 * @param Set_Of_Values A set of two or more values. A concatenation of
 *        attribute values for each of the attribute handles in the request in
 *        the order that they were requested.
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_read_multiple_resp_event(uint16_t Connection_Handle,
                                          uint16_t CID,
                                          uint16_t Event_Data_Length,
                                          uint8_t Set_Of_Values[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_read_multiple_resp_event\r\n");
}
/**
 * @brief This event is generated in response to a Read By Group Type Request,
 *        during a "discover all primary services" procedure. See
 *        aci_gatt_clt_disc_all_primary_services().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Data_Length The size of each attribute data
 * @param Data_Length Length of Attribute_Data_List in octets
 * @param Attribute_Data_List Attribute Data List as defined in Bluetooth Core
 *        v4.1 spec. A sequence of attribute handle, end group handle, attribute
 *        value tuples: [2 octets for Attribute Handle, 2 octets End Group
 *        Handle, (Attribute_Data_Length - 4 octets) for Attribute Value]
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_read_by_group_type_resp_event(uint16_t Connection_Handle,
                                               uint16_t CID,
                                               uint8_t Attribute_Data_Length,
                                               uint16_t Data_Length,
                                               uint8_t Attribute_Data_List[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_read_by_group_type_resp_event\r\n");
}
/**
 * @brief This event is generated in response to an ATT_PREPARE_WRITE_REQ during
 *        a write long characteristic value procedure. See
 *        aci_gatt_clt_write_long().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute to be written
 * @param Offset The offset of the first octet to be written.
 * @param Part_Attribute_Value_Length Length of Part_Attribute_Value in octets
 * @param Part_Attribute_Value The value of the attribute to be written
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_prepare_write_resp_event(uint16_t Connection_Handle,
                                          uint16_t CID,
                                          uint16_t Attribute_Handle,
                                          uint16_t Offset,
                                          uint16_t Part_Attribute_Value_Length,
                                          uint8_t Part_Attribute_Value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_prepare_write_resp_event\r\n");
}
/**
 * @brief This event is generated in response to an ATT Execute Write Request,
 *        during a write long characteristic value procedure. See
 *        aci_gatt_clt_write_long().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_exec_write_resp_event(uint16_t Connection_Handle,
                                       uint16_t CID))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_exec_write_resp_event\r\n");
}
/**
 * @brief This event is generated when an indication is received from the
 *        server.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute
 * @param Attribute_Value_Length Length of Attribute_Value in octets
 * @param Attribute_Value The current value of the attribute
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_clt_indication_event(uint16_t Connection_Handle,
                                   uint16_t CID,
                                   uint16_t Attribute_Handle,
                                   uint16_t Attribute_Value_Length,
                                   uint8_t Attribute_Value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_clt_indication_event\r\n");
}
/**
 * @brief This event is generated when a notification is received from the
 *        server.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute
 * @param Attribute_Value_Length Length of Attribute_Value in octets
 * @param Attribute_Value The current value of the attribute
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_clt_notification_event(uint16_t Connection_Handle,
                                     uint16_t CID,
                                     uint16_t Attribute_Handle,
                                     uint16_t Attribute_Value_Length,
                                     uint8_t Attribute_Value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_clt_notification_event\r\n");
}
/**
 * @brief This event is generated when a GATT client procedure completes either
 *        with error or successfully.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Error_Code For standard error codes see Bluetooth specification, Vol.
 *        2, part D. For proprietary error code refer to Error codes section.
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_clt_proc_complete_event(uint16_t Connection_Handle,
                                      uint16_t CID,
                                      uint8_t Error_Code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_clt_proc_complete_event\r\n");
}
/**
 * @brief This event is generated when an Error Response is received from the
 *        server. The error response can be given by the server at the end of
 *        one of the GATT discovery procedures. This does not mean that the
 *        procedure ended with an error, but this error event is part of the
 *        procedure itself.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Req_Opcode The request that generated this error response
 * @param Attribute_Handle The attribute handle that generated this error
 *        response
 * @param Error_Code The reason why the request has generated an error response
 *        (ATT error codes)
 *        Values:
 *        - 0x01: Invalid handle
 *        - 0x02: Read not permitted
 *        - 0x03: Write not permitted
 *        - 0x04: Invalid PDU
 *        - 0x05: Insufficient authentication
 *        - 0x06: Request not supported
 *        - 0x07: Invalid offset
 *        - 0x08: Insufficient authorization
 *        - 0x09: Prepare queue full
 *        - 0x0A: Attribute not found
 *        - 0x0B: Attribute not long
 *        - 0x0C: Insufficient encryption key size
 *        - 0x0D: Invalid attribute value length
 *        - 0x0E: Unlikely error
 *        - 0x0F: Insufficient encryption
 *        - 0x10: Unsupported group type
 *        - 0x11: Insufficient resources
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_clt_error_resp_event(uint16_t Connection_Handle,
                                   uint16_t CID,
                                   uint8_t Req_Opcode,
                                   uint16_t Attribute_Handle,
                                   uint8_t Error_Code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_clt_error_resp_event\r\n");
}
/**
 * @brief This event can be generated during a "Discover Characteristics By
 *        UUID" procedure or a "Read using Characteristic UUID" procedure.
 *        During a "Discover Characteristics By UUID" procedure, Attribute_Value
 *        is a characteristic declaration as defined in Bluetooth Core spec
 *        (vol.3, Part G, ch. 3.3.1), i.e. it is composed by: Characteristic
 *        Properties (1 octet), Characteristic Value Handle (2 octets) and
 *        Characteristic UUID (2 or 16 octets). During a "Read using
 *        Characteristic UUID" procedure, Attribute_Value is the value of the
 *        characteristic.
 * @param Connection_Handle Connection handle related to the response
