sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events_cb.c
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute
 * @param Attribute_Value_Length Length of Attribute_Value in octets
 * @param Attribute_Value The attribute value will be a characteristic
 *        declaration as defined in Bluetooth Core spec (vol.3, Part G, ch.
 *        3.3.1), when a "Discover Characteristics By UUID" has been started. It
 *        will be the value of the Characteristic if a "Read using
 *        Characteristic UUID" has been performed.
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_clt_disc_read_char_by_uuid_resp_event(uint16_t Connection_Handle,
                                                    uint16_t CID,
                                                    uint16_t Attribute_Handle,
                                                    uint8_t Attribute_Value_Length,
                                                    uint8_t Attribute_Value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_clt_disc_read_char_by_uuid_resp_event\r\n");
}
/**
 * @brief Each time Bluetooth stack raises the error code
 *        BLE_STATUS_INSUFFICIENT_RESOURCES, aci_gatt_tx_pool_available_event()
 *        is generated as soon as the available buffer size is greater than
 *        maximum ATT MTU.
 * @param Connection_Handle Connection handle related to the request
 * @param Available_Buffers Not used.
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_tx_pool_available_event(uint16_t Connection_Handle,
                                      uint16_t Available_Buffers))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_tx_pool_available_event\r\n");
}
/**
 * @brief This event is generated when the client has sent the confirmation to a
 *        previously sent indication.
 * @param Connection_Handle Connection handle related to the event.
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_srv_confirmation_event(uint16_t Connection_Handle,
                                     uint16_t CID))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_srv_confirmation_event\r\n");
}
/**
 * @brief This event is generated when an execute write request is received from
 *        the peer. This happens when the client wants to write a long attribute
 *        (i.e. an attribute with a size greater than ATT_MTU -3) or more than
 *        one attribute in a single operation. The aci_gatt_srv_resp command
 *        must be sent to give a response to the peer.
 * @param Connection_Handle Handle identifying the connection where the execute
 *        write operation has been received.
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Flags If 1, peer wants to execute all the queued writes. If 0, all
 *        queued writes must be discarded.
 *        Values:
 *        - 0x00: FLUSH
 *        - 0x01: EXECUTE
 * @retval None
 */
WEAK_FUNCTION(void aci_att_srv_exec_write_req_event(uint16_t Connection_Handle,
                                      uint16_t CID,
                                      uint8_t Flags))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_srv_exec_write_req_event\r\n");
}
/**
 * @brief This event is generated if authorization is needed to access the
 *        attribute value. aci_gatt_srv_authorize_resp_nwk command must be sent
 *        in response to this event.
 * @param Conn_Handle Connection handle to be used to identify the connection
 *        with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attr_Handle
 * @param Operation_Type
 *        Values:
 *        - 0x00: Read
 *        - 0x10: Write Request
 *        - 0x11: Write Command or Signed Write Command
 *        - 0x12: Prepare Write Request
 * @param Attr_Val_Offset Offset from which the value needs to be read or write
 *        Values:
 *        - 0 ... 511
 * @param Data_Length Length of Data field
 * @param Data The data that the client has requested to write
 * @retval None
 */
WEAK_FUNCTION(void aci_gatt_srv_authorize_nwk_event(uint16_t Conn_Handle,
                                      uint16_t CID,
                                      uint16_t Attr_Handle,
                                      uint8_t Operation_Type,
                                      uint16_t Attr_Val_Offset,
                                      uint8_t Data_Length,
                                      uint8_t Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_gatt_srv_authorize_nwk_event\r\n");
}
/**
 * @brief This event is generated in response to a Read Multiple Variable
 *        Request. See aci_gatt_clt_read_multiple_var_len_char_value().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Event_Data_Length Length of following data
 * @param Set_Of_Values A set of two or more values. A concatenation of
 *        attribute values for each of the attribute handles in the request in
 *        the order that they were requested.
 * @retval None
 */
WEAK_FUNCTION(void aci_att_clt_read_multiple_var_len_resp_event(uint16_t Connection_Handle,
                                                  uint16_t CID,
                                                  uint16_t Event_Data_Length,
                                                  uint8_t Set_Of_Values[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("aci_att_clt_read_multiple_var_len_resp_event\r\n");
}
/**
 * @}
 */
/**
 * @}
 */

