sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events_cb.c
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 60 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @retval None
 */
WEAK_FUNCTION(void hci_le_periodic_advertising_sync_transfer_received_event(uint8_t Status,
                                                              uint16_t Connection_Handle,
                                                              uint16_t Service_data,
                                                              uint16_t Sync_Handle,
                                                              uint8_t Advertising_SID,
                                                              uint8_t Advertiser_Address_Type,
                                                              uint8_t Advertiser_Address[6],
                                                              uint8_t Advertiser_PHY,
                                                              uint16_t Periodic_Advertising_Interval,
                                                              uint8_t Advertiser_Clock_Accuracy))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_periodic_advertising_sync_transfer_received_event\r\n");
}
/**
 * @brief The HCI_LE_CIS_Established event indicates that a CIS has been
 *        established, was considered lost before being established, or (on the
 *        Central) was rejected by the Peripheral. It is generated by the
 *        Controller in the Central and Peripheral. The Connection_Handle
 *        parameter shall be set to the value provided in the HCI_LE_Create_CIS
 *        command on the Central and in the HCI_LE_CIS_Request event on the
 *        Peripheral. The CIG_Sync_Delay parameter is the maximum time, in
 *        microseconds, for transmission of PDUs of all CISes in a CIG event
 *        (see [Vol 6] Part B, Section 4.5.14.1). The CIS_Sync_Delay parameter
 *        is the maximum time, in microseconds, for transmission of PDUs of the
 *        specified CIS in a CIG event (see [Vol 6] Part B, Section 4.5.14.1).
 *        The Transport_Latency_C_To_P and Transport_Latency_P_To_C parameters
 *        are the actual transport latencies, in microseconds, as described in
 *        [Vol 6] Part G, Section 3.2.1 and [Vol 6] Part G, Section 3.2.2. The
 *        PHY_C_To_P parameter indicates the PHY selected for packets from the
 *        Central to Peripheral. The PHY_P_To_C parameter indicates the PHY
 *        selected for packets from the Peripheral to Central. The NSE,
 *        BN_C_To_P, BN_P_To_C, FT_C_To_P, FT_P_To_C, Max_PDU_- C_To_P,
 *        Max_PDU_P_To_C, and ISO_Interval parameters are the corresponding
 *        parameters of the CIS (see [Vol 6] Part B, Section 4.5.13.1). If this
 *        event is generated on the Peripheral with a non-zero status, the
 *        Controller shall delete the Connection_Handle and any associated ISO
 *        data paths.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle of the CIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CIG_Sync_Delay The maximum time, in microseconds, for transmission of
 *        PDUs of all CISes in a CIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param CIS_Sync_Delay The maximum time, in microseconds, for transmission of
 *        PDUs of the specified CIS in a CIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_C_To_P The actual transport latency, in
 *        microseconds, from Central to Peripheral.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_P_To_C The actual transport latency, in
 *        microseconds, from Peripheral to Central.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param PHY_C_To_P The transmitter PHY of packets from the Central.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param PHY_P_To_C The transmitter PHY of packets from the Peripheral.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param NSE Maximum number of subevents in each isochronous event.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param BN_C_To_P The burst number for Central to Peripheral transmission.
 *        Values:
 *        - 0x00: No data
 *        - 0x01 ... 0x0F
 * @param BN_P_To_C The burst number for Peripheral to Central transmission.
 *        Values:
 *        - 0x00: No data
 *        - 0x01 ... 0x0F
 * @param FT_C_To_P The flush timeout, in multiples of the ISO_Interval for the
 *        CIS, for each payload sent from the Central to the Peripheral.
 *        Values:
 *        - 0x01 ... 0xFF
 * @param FT_P_To_C The flush timeout, in multiples of the ISO_Interval for the
 *        CIS, for each payload sent from the Peripheral to the Central.
 *        Values:
 *        - 0x01 ... 0xFF
 * @param Max_PDU_C_To_P Maximum size, in octets, of the payload from Central to
 *        Peripheral.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param Max_PDU_P_To_C Maximum size, in octets, of the payload from Peripheral
 *        to Central.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param ISO_Interval The time between two consecutive CIS anchor points. Time
 *        = N * 1.25 ms.
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @retval None
 */
WEAK_FUNCTION(void hci_le_cis_established_event(uint8_t Status,
                                  uint16_t Connection_Handle,
                                  uint8_t CIG_Sync_Delay[3],
                                  uint8_t CIS_Sync_Delay[3],
                                  uint8_t Transport_Latency_C_To_P[3],
                                  uint8_t Transport_Latency_P_To_C[3],
                                  uint8_t PHY_C_To_P,
                                  uint8_t PHY_P_To_C,
                                  uint8_t NSE,
                                  uint8_t BN_C_To_P,
                                  uint8_t BN_P_To_C,
                                  uint8_t FT_C_To_P,
                                  uint8_t FT_P_To_C,
                                  uint16_t Max_PDU_C_To_P,
                                  uint16_t Max_PDU_P_To_C,
                                  uint16_t ISO_Interval))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_cis_established_event\r\n");
}
/**
 * @brief The HCI_LE_CIS_Request event indicates that a Controller has received
 *        a request to establish a CIS. If the Controller receives such a
 *        request while the HCI_LE_CIS_Request event is masked away, it shall
 *        reject it. Otherwise the Controller shall assign a connection handle
 *        for the requested CIS and send the handle in the CIS_Connection_Handle
 *        parameter of the event. When the Host receives this event it shall
 *        respond with either an HCI_LE_Accept_CIS_Request command or an
 *        HCI_LE_Reject_CIS_Request command before the timer
 *        Connection_Accept_Timeout expires. If it does not, the Controller
 *        shall reject the request and generate an HCI_LE_CIS_Established event
 *        with the status Connection Accept Timeout Exceeded (0x10). The
 *        ACL_Connection_Handle is the connection handle of the ACL connection
 *        that is associated with the requested CIS. The CIG_ID parameter
 *        contains the identifier of the CIG that contains the requested CIS.
 *        This parameter is sent by the Central in the request to establish the
 *        CIS. The CIS_ID parameter contains the identifier of the requested
 *        CIS. This parameter is sent by the Central in the request to establish
 *        the CIS.
 * @param ACL_Connection_Handle Connection handle of the ACL.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CIS_Connection_Handle Connection handle of the CIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CIG_ID Identifier of the CIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param CIS_ID Identifier of the CIS.
 *        Values:
 *        - 0x00 ... 0xEF
 * @retval None
 */
WEAK_FUNCTION(void hci_le_cis_request_event(uint16_t ACL_Connection_Handle,
                              uint16_t CIS_Connection_Handle,
                              uint8_t CIG_ID,
                              uint8_t CIS_ID))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_cis_request_event\r\n");
}
/**
 * @brief The HCI_LE_Create_BIG_Complete event indicates that the
 *        HCI_LE_Create_BIG command has completed.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param BIG_Sync_Delay The maximum time in microseconds for transmission of
 *        PDUs of all BISes in a BIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_BIG The maximum delay time, in microseconds, for
 *        transmission of SDUs of all BISes in a BIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param PHY The PHY used to create the BIG.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param NSE The number of subevents in each BIS event in the BIG.
 *        Values:
 *        - 0x01 ... 0x1E
 * @param BN The number of new payloads in each BIS event.
 *        Values:
 *        - 0x01 ... 0x07
 * @param PTO Offset used for pre-transmissions.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param IRC The number of times a payload is transmitted in a BIS event.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Max_PDU Maximum size, in octets, of the payload.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param ISO_Interval The time between two consecutive BIG anchor points. Time
 *        = N * 1.25 ms.
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Num_BIS Total number of BISes in the BIG.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param Connection_Handle The connection handles of the BISes in the BIG.
 * @retval None
 */
WEAK_FUNCTION(void hci_le_create_big_complete_event(uint8_t Status,
                                      uint8_t BIG_Handle,
                                      uint8_t BIG_Sync_Delay[3],
                                      uint8_t Transport_Latency_BIG[3],
                                      uint8_t PHY,
                                      uint8_t NSE,
                                      uint8_t BN,
                                      uint8_t PTO,
                                      uint8_t IRC,
                                      uint16_t Max_PDU,
                                      uint16_t ISO_Interval,
                                      uint8_t Num_BIS,
                                      uint16_t Connection_Handle[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_create_big_complete_event\r\n");
}
/**
 * @brief The HCI_LE_Terminate_BIG_Complete event indicates that the
 *        transmission of all the BISes in the BIG are terminated.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Reason Reason for termination. See Error Codes.
 * @retval None
 */
WEAK_FUNCTION(void hci_le_terminate_big_complete_event(uint8_t BIG_Handle,
                                         uint8_t Reason))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_terminate_big_complete_event\r\n");
}
/**
 * @brief The HCI_LE_BIG_Sync_Established event indicates that the
 *        HCI_LE_BIG_Create_Sync command has completed.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Transport_Latency_BIG The maximum delay time, in microseconds, for
 *        transmission of SDUs of all BISes in a BIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param NSE The number of subevents in each BIS event in the BIG.
 *        Values:
 *        - 0x01 ... 0x1E
 * @param BN The number of new payloads in each BIS event.
 *        Values:
 *        - 0x01 ... 0x07
 * @param PTO Offset used for pre-transmissions.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param IRC The number of times a payload is transmitted in a BIS event.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Max_PDU Maximum size, in octets, of the payload.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param ISO_Interval The time between two consecutive BIG anchor points. Time
 *        = N * 1.25 ms.
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Num_BIS Total number of BISes in the BIG.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param Connection_Handle The connection handles of the BISes in the BIG.
 * @retval None
 */
WEAK_FUNCTION(void hci_le_big_sync_established_event(uint8_t Status,
                                       uint8_t BIG_Handle,
                                       uint8_t Transport_Latency_BIG[3],
                                       uint8_t NSE,
                                       uint8_t BN,
                                       uint8_t PTO,
                                       uint8_t IRC,
                                       uint16_t Max_PDU,
                                       uint16_t ISO_Interval,
                                       uint8_t Num_BIS,
                                       uint16_t Connection_Handle[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_big_sync_established_event\r\n");
}
/**
 * @brief The HCI_LE_BIG_Sync_Lost event indicates that the Controller has not
 *        received any PDUs on a BIG within the timeout period BIG_Sync_Timeout
 *        or the BIG has been terminated by the remote device.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Reason Reason for termination. See Error Codes.
 * @retval None
 */
WEAK_FUNCTION(void hci_le_big_sync_lost_event(uint8_t BIG_Handle,
                                uint8_t Reason))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_big_sync_lost_event\r\n");
}
/**
 * @brief The HCI_LE_Request_Peer_SCA_Complete event indicates that the
 *        HCI_LE_Request_Peer_SCA command has been completed. The
 *        Peer_Clock_Accuracy parameter contains the sleep clock accuracy of the
 *        peer. The Connection_Handle is the connection handle of the ACL
 *        connection in which the HCI_LE_Request_Peer_SCA command is issued.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle of the ACL.
 * @param Peer_Clock_Accuracy Sleep clock accuracy of the peer.
 *        Values:
 *        - 0x00: 251 ppm to 500 ppm
 *        - 0x01: 151 ppm to 250 ppm
 *        - 0x02: 101 ppm to 150 ppm
 *        - 0x03: 76 ppm to 100 ppm
 *        - 0x04: 51 ppm to 75 ppm
 *        - 0x05: 31 ppm to 50 ppm
 *        - 0x06: 21 ppm to 30 ppm
 *        - 0x07: 0 ppm to 20 ppm
 * @retval None
 */
WEAK_FUNCTION(void hci_le_request_peer_sca_complete_event(uint8_t Status,
                                            uint16_t Connection_Handle,
                                            uint8_t Peer_Clock_Accuracy))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_request_peer_sca_complete_event\r\n");
}
/**
 * @brief Report a path loss threshold crossing on the ACL connection identified
 *        by the Connection_Handle parameter.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Current_Path_Loss Current path loss (always zero or positive). Units:
 *        dB.
 *        Values:
 *        - 0 ... 254
 *        - 255: NA
 * @param Zone_Entered The Zone_Entered parameter indicates which zone was
 *        entered.
 *        Values:
 *        - 0x00: LOW_ZONE
 *        - 0x01: MIDDLE_ZONE
 *        - 0x02: HIGH_ZONE
 * @retval None
 */
WEAK_FUNCTION(void hci_le_path_loss_threshold_event(uint16_t Connection_Handle,
                                      uint8_t Current_Path_Loss,
                                      uint8_t Zone_Entered))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_path_loss_threshold_event\r\n");
}
/**
 * @brief Report the transmit power level on the ACL connection identified by
 *        the Connection_Handle parameter.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Reason The reason why the event was sent and the device whose transmit
 *        power level is being reported. - 0x00: Local transmit power changed -
 *        0x01: Remote transmit power changed - 0x02:
 *        HCI_LE_Read_Remote_Transmit_Power_Level command completed
 *        Values:
 *        - 0x00: LOCAL_TX_POWER_CHANGE
 *        - 0x01: REMOTE_TX_POWER_CHANGE
 *        - 0x02: READ_REMOTE_TX_POWER_COMPLETE
 * @param PHY PHY associated with the connection  (not necessarily the currently
 *        used one).
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY_S8
 *        - 0x04: LE_CODED_PHY_S2
 * @param Transmit_Power_Level The transmit power level for the PHY (dBm).
 *        Values:
 *        - -127 ... 20
 *        - 126: POWER_NOT_MANAGED
 *        - 127: POWER_NA
 * @param Transmit_Power_Level_Flag It indicates whether the transmit power
 *        level that is being reported has reached its minimum and/or maximum
 *        level. Transmit_Power_Level_Flag shall be ignored if the
 *        Transmit_Power_Level parameter is set to 0x7E or 0x7F.
 *        Flags:
 *        - 0x01: MIN_TX_POWER_BIT
 *        - 0x02: MAX_TX_POWER_BIT
 * @param Delta The Delta parameter is set to the change in power level for the
 *        transmitter being reported, whenever it changes its transmit power
 *        level. Delta shall be ignored if the Transmit_Power_Level parameter is
 *        set to 0x7E.
 *        Values:
 *        - 0 ... 126
 *        - 127: NA
 * @retval None
 */
WEAK_FUNCTION(void hci_le_transmit_power_reporting_event(uint8_t Status,
                                           uint16_t Connection_Handle,
                                           uint8_t Reason,
                                           uint8_t PHY,
                                           int8_t Transmit_Power_Level,
                                           uint8_t Transmit_Power_Level_Flag,
                                           int8_t Delta))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_transmit_power_reporting_event\r\n");
}
/**
 * @brief The HCI_LE_BIGInfo_Advertising_Report event indicates that the
 *        Controller has received an Advertising PDU that contained a BIGInfo
 *        field. If the Controller also generates an
 *        HCI_LE_Periodic_Advertising_Report event, the
 *        HCI_LE_BIGInfo_Advertising_Report event shall immediately follow that
 *        event. An HCI_LE_BIGInfo_Advertising_Report event shall be generated
 *        even if the Controller is already synchronized to the BIG. The
 *        Sync_Handle parameter shall identify the periodic advertising train
 *        containing the BIGInfo field and shall be the same as the
 *        corresponding field in the HCI_LE_Periodic_Advertising_Report event if
 *        one is generated. The Num_BIS, NSE, ISO_Interval, BN, PTO, IRC,
 *        Max_PDU, SDU_Interval, Max_SDU, PHY, and Framing parameters correspond
 *        to the associated fields in the BIGInfo field of the Advertising PDU.
 *        If the BIGInfo field indicates that the corresponding BIG is
 *        encrypted, the Encryption parameter shall be set to 0x01. Otherwise,
 *        the Encryption parameter shall be set to 0x00.
 * @param Sync_Handle Sync_Handle identifying the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Num_BIS Value of the Num_BIS subfield of the BIGInfo field.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param NSE Value of the NSE subfield of the BIGInfo field.
 * @param ISO_Interval Value of the ISO_Interval subfield of the BIGInfo field.
 * @param BN Value of the BN subfield of the BIGInfo field.
 *        Values:
 *        - 0x01 ... 0x07
 * @param PTO Value of the PTO subfield of the BIGInfo field.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param IRC Value of the IRC subfield of the BIGInfo field.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Max_PDU Value of the Max_PDU subfield of the BIGInfo.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param SDU_Interval Value of the SDU_Interval subfield of the BIGInfo field.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param Max_SDU Value of the Max_SDU subfield of the BIGInfo field in the
 *        Advertising PDU.
 *        Values:
 *        - 0x0001 ... 0x0FFF
 * @param PHY The PHY on which the BIG is transmitted.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param Framing If BIG carries encrypted (1) or unencrypted (0) data.
 *        Values:
 *        - 0x00: Unencrypted
 *        - 0x01: Encrypted
 * @param Encryption If BIG carries encrypted (1) or unencrypted (0) data.
 *        Values:
 *        - 0x00: Unencrypted
 *        - 0x01: Encrypted
 * @retval None
 */
WEAK_FUNCTION(void hci_le_biginfo_advertising_report_event(uint16_t Sync_Handle,
                                             uint8_t Num_BIS,
                                             uint8_t NSE,
                                             uint16_t ISO_Interval,
                                             uint8_t BN,
                                             uint8_t PTO,
                                             uint8_t IRC,
                                             uint16_t Max_PDU,
                                             uint8_t SDU_Interval[3],
                                             uint16_t Max_SDU,
                                             uint8_t PHY,
                                             uint8_t Framing,
