sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events_cb.c
                                             uint8_t Encryption))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_biginfo_advertising_report_event\r\n");
}
/**
 * @brief The HCI_LE_Subrate_Change event is used to indicate that a Connection
 *        Subrate Update procedure has completed and some parameters of the
 *        specified connection have changed. This event shall be issued if the
 *        HCI_LE_Subrate_Request command was issued by the Host or the
 *        parameters are updated successfully following a request from the peer
 *        device. If no parameters are updated following a request from the peer
 *        device or the parameters were changed using the Connection Update
 *        procedure, then this event shall not be issued.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Handle identifing the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Subrate_Factor New subrate factor applied to the specified underlying
 *        connection interval.
 *        Values:
 *        - 0x0001 ... 0x01F4
 * @param Peripheral_Latency New Peripheral latency for the connection in number
 *        of subrated connection events,
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Continuation_Number Number of underlying connection events to remain
 *        active after a packet containing a Link Layer PDU with a non-zero
 *        Length field is sent or received.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout New supervision timeout for this connection. Time
 *        = N x 10 ms.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @retval None
 */
WEAK_FUNCTION(void hci_le_subrate_change_event(uint8_t Status,
                                 uint16_t Connection_Handle,
                                 uint16_t Subrate_Factor,
                                 uint16_t Peripheral_Latency,
                                 uint16_t Continuation_Number,
                                 uint16_t Supervision_Timeout))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_subrate_change_event\r\n");
}
/* hci_le_periodic_advertising_sync_established_v2_event */
/* Event len: 1 + 2 + 1 + 1 + 6 + 1 + 2 + 1 + 1 + 1 + 1 + 1 */
/**
 * @brief The HCI_LE_Periodic_Advertising_Sync_Established event indicates that
 *        the Controller has received the first periodic advertising packet from
 *        an advertiser after the HCI_LE_Periodic_Advertising_Create_Sync
 *        command has been sent to the Controller. The Sync_Handle parameter
 *        identifies the periodic advertising train in subsequent commands and
 *        events and shall be assigned by the Controller. The Advertising_SID
 *        parameter is set to the value of the Advertising SID subfield in the
 *        ADI field of the advertising PDU referring to the periodic advertising
 *        train. The Advertiser_Address_Type and Advertiser_Address parameters
 *        specify the address of the periodic advertiser. The Advertiser_PHY
 *        parameter specifies the PHY used for the periodic advertising. The
 *        Periodic_Advertising_Interval parameter specifies the interval between
 *        the periodic advertising events. The Advertiser_Clock_Accuracy
 *        parameter specifies the accuracy of the periodic advertiser's clock.
 *        If the periodic advertising has subevents or response slots, then the
 *        Num_- Subevents, Subevent_Interval, Response_Slot_Delay, and
 *        Response_Slot_- Spacing specify the parameters for these subevents,
 *        otherwise these values shall be set to 0x00.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID Advertising SID subfield in the ADI field of the PDU
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
 *        - 0x10 ... 0xFF: Reserved for future use
 * @param Advertiser_Address_Type Advertising Adress Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved PrivateAddress)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY Advertiser PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 *        - 0x04 ... 0xFF: Reserved for future use
 * @param Periodic_Advertising_Interval Periodic Advertising Interval Time = N *
 *        1.25 ms Time Range: 7.5 ms to 81.91875 s
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 *        - 0x08 ... 0xFF: Reserved for future use
 * @param Num_Subevents Number of subevents.
 *        Values:
 *        - 0x00 ... 0x80
 * @param Subevent_Interval Subevent interval. Time = N x 1.25 ms.
 *        Values:
 *        - 0x00 (NaN) : No subevents
 *        - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 * @param Response_Slot_Delay Response slot delay. Range: 0x01 to 0xFE. Time = N
 *        x 1.25 ms
 *        Values:
 *        - 0x00 (NaN) : No response slots
 *        - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 * @param Response_Slot_Spacing Response slot spacing Range: 0x02 to 0xFF Time =
 *        N x 0.125 ms
 *        Values:
 *        - 0x00 (0.000 ms) : No response slots
 *        - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 * @retval None
 */

WEAK_FUNCTION(void hci_le_periodic_advertising_sync_established_v2_event(uint8_t Status,
                                                              uint16_t Sync_Handle,
                                                              uint8_t Advertising_SID,
                                                              uint8_t Advertiser_Address_Type,
                                                              uint8_t Advertiser_Address[6],
                                                              uint8_t Advertiser_PHY,
                                                              uint16_t Periodic_Advertising_Interval,
                                                              uint8_t Advertiser_Clock_Accuracy,
                                                              uint8_t Num_Subevents,
                                                              uint8_t Subevent_Interval,
                                                              uint8_t Response_Slot_Delay,
                                                              uint8_t Response_Slot_Spacing))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_periodic_advertising_sync_established_v2_event\r\n");
}
/* hci_le_periodic_advertising_report_v2_event */
/* Event len: 2 + 1 + 1 + 1 + 2 + 1 + 1 + 1 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief The HCI_LE_Periodic_Advertising_Report event indicates that the
 *        Controller has received a periodic advertisement or has failed to
 *        receive an AUX_SYNC_SUBEVENT_IND PDU. The Sync_Handle parameter
 *        identifies the periodic advertising train that the report relates to.
 *        The RSSI parameter contains the RSSI value, excluding any Constant
 *        Tone Extension. If the Controller supports the Connectionless CTE
 *        Receiver feature, RSSI shall not be set to 0x7F. When multiple
 *        advertising packets are used to complete a periodic advertising report
 *        (e.g., a packet containing an AUX_SYNC_IND PDU combined with one
 *        containing an AUX_CHAIN PDU), the RSSI event parameter shall be set
 *        based on the last packet received and the TX_Power event parameter
 *        shall be set based on the AUX_SYNC_IND PDU. However, the second or
 *        subsequent events for the same periodic advertisement may instead have
 *        a TX_Power value of 0x7F. The Controller may split the data from a
 *        single periodic advertisement (whether one PDU or several) into
 *        several reports. If so, each report except the last shall have a
 *        Data_Status of "incomplete, more data to come", while the last shall
 *        have the value "complete". No further reports shall be sent for a
 *        given periodic advertisement after one with a Data_Status other than
 *        "incomplete, more data to come". A Data_Status of "incomplete, data
 *        truncated" indicates that the Controller attempted to receive an
 *        AUX_CHAIN_IND PDU but was not successful or received it but was unable
 *        to store the data. The CTE_Type parameter indicates the type of
 *        Constant Tone Extension in the periodic advertising packets. The
 *        Periodic_Event_Counter parameter indicates the periodic advertising
 *        event counter (paEventCounter) of the event that the periodic
 *        advertising packet was received in. The Subevent parameter indicates
 *        the Periodic Advertising with Responses subevent that the periodic
 *        advertising packet was received in. If the Periodic Advertising does
 *        not have subevents, then Subevent shall be set to 0xFF. If the
 *        Controller receives an AUX_CHAIN_IND PDU with no AdvData, it should
 *        send the report (or the last report if it has split the data)
 *        immediately without waiting for any subsequent AUX_CHAIN_IND PDUs.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param TX_Power TX Power. Units: dBm
 *        Values:
 *        - -127 ... 126
 *        - 127: NA
 * @param RSSI RSSI value Units: dBm
 *        Values:
 *        - -127 ... 20: RSSI value
 *        - 127: RSSI is not available
 * @param CTE_Type
 *        Values:
 *        - 0x00: AoA Constant Tone Extension
 *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 *        - 0xFF: No Constant Tone Extension
 * @param Periodic_Event_Counter The value of paEventCounter (see [Vol 6] Part
 *        B, Section 4.4.2.1) for the reported periodic advertising packet.
 * @param Subevent The subevent number.
 *        Values:
 *        - 0x00 ... 0x7F
 *        - 0xFF: No subevents
 * @param Data_Status Data Status
 *        Values:
 *        - 0x00: Data complete
 *        - 0x01: Data incomplete, more data to come
 *        - 0x02: Data incomplete, data truncated, no more to come
 *        - 0xFF: Failed to receive an AUX_SYNC_SUBEVENT_IND PDU
 * @param Data_Length Length of the Data field
 *        Values:
 *        - 0 ... 247: Length of the Data field
 *        - 248 ... 255: Reserved for future use
 * @param Data Data received from a Periodic Advertising packet
 * @retval None
 */

WEAK_FUNCTION(void hci_le_periodic_advertising_report_v2_event(uint16_t Sync_Handle,
                                                    int8_t TX_Power,
                                                    int8_t RSSI,
                                                    uint8_t CTE_Type,
                                                    uint16_t Periodic_Event_Counter,
                                                    uint8_t Subevent,
                                                    uint8_t Data_Status,
                                                    uint8_t Data_Length,
                                                    uint8_t Data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_periodic_advertising_report_v2_event\r\n");
}
/* hci_le_periodic_advertising_sync_transfer_received_v2_event */
/* Event len: 1 + 2 + 2 + 2 + 1 + 1 + 6 + 1 + 2 + 1 + 1 + 1 + 1 + 1 */
/**
 * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
 *        by the Controller to report that it has received periodic advertising
 *        synchronization information from the device referred to by the
 *        Connection_Handle parameter and either successfully synchronized to
 *        the periodic advertising train or timed out while attempting to
 *        synchronize. The Status will be zero if it successfully synchronized
 *        and non-zero otherwise. The Service_Data value is provided by the Host
 *        of the device sending the information. The Sync_Handle identifies the
 *        periodic advertising in subsequent commands and events and shall be
 *        assigned by the Controller. The remaining parameters provide
 *        information about the periodic advertising (see Section 7.7.65.14). If
 *        there are no subevents or response slots, then the Controller shall
 *        set the Num_Subevents parameter to zero and the Host shall ignore the
 *        Subevent_Interval, Response_Slot_Delay, and Response_Slot_- Spacing
 *        parameters. If Status is non-zero, all parameter values are valid
 *        except Sync_Handle, which the Host shall ignore. Note: If the
 *        Controller is already synchronized to the periodic advertising train
 *        described in the received information, no event will be generated.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Service_data A value provided by the peer device
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
 * @param Advertiser_Address_Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 * @param Periodic_Advertising_Interval Periodic advertising interval. Time = N
 *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 60 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @param Num_Subevents Number of subevents.
 *        Values:
 *        - 0x00 ... 0x80
 * @param Subevent_Interval Subevent interval. Time = N x 1.25 ms.
 *        Values:
 *        - 0x00 (NaN) : No subevents
 *        - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 * @param Response_Slot_Delay Response slot delay. Range: 0x01 to 0xFE. Time = N
 *        x 1.25 ms
 *        Values:
 *        - 0x00 (NaN) : No response slots
 *        - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 * @param Response_Slot_Spacing Response slot spacing Range: 0x02 to 0xFF Time =
 *        N x 0.125 ms
 *        Values:
 *        - 0x00 (0.000 ms) : No response slots
 *        - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 * @retval None
 */

WEAK_FUNCTION(void hci_le_periodic_advertising_sync_transfer_received_v2_event(uint8_t Status,
                                                                      uint16_t Connection_Handle,
                                                                      uint16_t Service_data,
                                                                      uint16_t Sync_Handle,
                                                                      uint8_t Advertising_SID,
                                                                      uint8_t Advertiser_Address_Type,
                                                                      uint8_t Advertiser_Address[6],
                                                                      uint8_t Advertiser_PHY,
                                                                      uint16_t Periodic_Advertising_Interval,
                                                                      uint8_t Advertiser_Clock_Accuracy,
                                                                      uint8_t Num_Subevents,
                                                                      uint8_t Subevent_Interval,
                                                                      uint8_t Response_Slot_Delay,
                                                                      uint8_t Response_Slot_Spacing))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_periodic_advertising_sync_transfer_received_v2_event\r\n");
}
/* hci_le_periodic_advertising_subevent_data_request_event */
/* Event len: 1 + 1 + 1 */
/**
 * @brief The HCI_LE_Periodic_Advertising_Subevent_Data_Request event is used to
 *        allow the Controller to indicate that it is ready to transmit one or
 *        more subevents and is requesting the advertising data for these
 *        subevents. The Subevent_Data_Count parameter shall be less than or
 *        equal to the number of subevents. The Subevent_Start parameter is the
 *        first subevent being requested and the Subevent_Data_Count parameter
 *        determines the subsequent subevents being requested. The subevent
 *        numbers wrap from one less than the number of subevents to zero. This
 *        event should be sent from the Controller when it has no data for
 *        upcoming subevents. The Controller should request data for as many
 *        subevents as it has memory to accept to minimize the number of events
 *        generated by the Controller.
 * @param Advertising_Handle Used to identify a periodic advertising train.
 * @param Subevent_Start The first subevent that data is requested for.
 *        Values:
 *        - 0x00 ... 0x7F
 * @param Subevent_Data_Count The number of subevents that data is requested
 *        for.
 *        Values:
 *        - 0x01 ... 0x80
 * @retval None
 */

