sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events_cb.c
WEAK_FUNCTION(void hci_le_periodic_advertising_subevent_data_request_event(uint8_t Advertising_Handle,
                                                                uint8_t Subevent_Start,
                                                                uint8_t Subevent_Data_Count))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_periodic_advertising_subevent_data_request_event\r\n");
}
/* hci_le_periodic_advertising_response_report_event */
/* Event len: 1 + 1 + 1 + 1 + struct_length */
/**
 * @brief The HCI_LE_Periodic_Advertising_Response_Report event indicates that
 *        one or more Bluetooth devices have responded to a periodic advertising
 *        subevent during a PAwR train. The Controller may queue these
 *        advertising reports and send information from multiple devices in one
 *        HCI_LE_Periodic_Advertising_- Response_Report event. The Controller
 *        may fail to transmit the synchronization packet required to enable the
 *        response packets to be sent. If this happens, the Controller can
 *        report this to the Host using the Tx_Status parameter. The Controller
 *        may split the data from a single response into several reports. If so,
 *        each report except the last shall have a Data_Status of "incomplete,
 *        more data to come", while the last shall have the value "complete". No
 *        further reports shall be sent for a given periodic advertisement after
 *        one with a Data_Status other than "incomplete, more data to come".
 * @param Advertising_Handle Used to identify a periodic advertising train.
 * @param Subevent The subevent number.
 * @param Tx_Status If AUX_SYNC_SUBEVENT_IND was transmitted or not.
 * @param Num_Responses Number of responses in event.
 *        Values:
 *        - 0x00 ... 0x19
 * @param Periodic_Advertising_Response See @ref Periodic_Advertising_Response_t
 * @retval None
 */

WEAK_FUNCTION(void hci_le_periodic_advertising_response_report_event(uint8_t Advertising_Handle,
                                                            uint8_t Subevent,
                                                            uint8_t Tx_Status,
                                                            uint8_t Num_Responses,
                                                            Periodic_Advertising_Response_t Periodic_Advertising_Response[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_periodic_advertising_response_report_event\r\n");
}
/* hci_le_enhanced_connection_complete_v2_event */
/* Event len: 1 + 2 + 1 + 1 + 6 + 6 + 6 + 2 + 2 + 2 + 1 + 1 + 2 */
/**
 * @brief The HCI_LE_Enhanced_Connection_Complete event indicates to both of the
 *        Hosts forming the connection that a new connection has been created.
 *        Upon the creation of the connection a Connection_Handle shall be
 *        assigned by the Controller, and passed to the Host in this event. If
 *        the connection creation fails, this event shall be provided to the
 *        Host that had issued the HCI_LE_Create_- Connection or
 *        HCI_LE_Extended_Create_Connection command. If this event is unmasked
 *        and the HCI_LE_Connection_Complete event is unmasked, only the
 *        HCI_LE_Enhanced_Connection_Complete event is sent when a new
 *        connection has been created. This event indicates to the Host that
 *        issued an HCI_LE_Create_Connection or
 *        HCI_LE_Extended_Create_Connection command and received an
 *        HCI_Command_Status event if the connection creation failed or was
 *        successful. The Peer_Address, Peer_Resolvable_Private_Address, and
 *        Local_- Resolvable_Private_Address shall always reflect the most
 *        recent packet sent and received on air. The Central_Clock_Accuracy
 *        parameter is only valid for a Peripheral. On a Central, this parameter
 *        shall be set to 0x00. If the connection is established from periodic
 *        advertising with responses and Role is 0x00, then the
 *        Advertising_Handle parameter shall be set according to the periodic
 *        advertising train the connection was established from. If the
 *        connection is established from periodic advertising with responses and
 *        Role is 0x01, then the Sync_Handle parameter shall be set according to
 *        the periodic advertising train the connection was established from. In
 *        all other circumstances, Advertising_Handle and Sync_Handle shall be
 *        set to No Advertising_Handle and No Sync_Handle and shall be ignored
 *        by the Host.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Role Role of the local device in the connection.
 *        Values:
 *        - 0x00: Central
 *        - 0x01: Peripheral
 * @param Peer_Address_Type 0x00 Public Device Address 0x01 Random Device
 *        Address 0x02 Public Identity Address (Corresponds to Resolved Private
 *        Address) 0x03 Random (Static) Identity Address (Corresponds to
 *        Resolved Private Address)
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address
 *        - 0x03: Random (Static) Identity Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address or Random (static) Identity Address of the device to
 *        be connected.
 * @param Local_Resolvable_Private_Address Resolvable Private Address being used
 *        by the local device for this connection. This is only valid when the
 *        Own_Address_Type is set to 0x02 or 0x03. For other Own_Address_Type
 *        values, the Controller shall return all zeros.
 * @param Peer_Resolvable_Private_Address Resolvable Private Address being used
 *        by the peer device for this connection. This is only valid for
 *        Peer_Address_Type 0x02 and 0x03. For other Peer_Address_Type values,
 *        the Controller shall return all zeros.
 * @param Connection_Interval Connection interval used on this connection. Time
 *        = N * 1.25 msec
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Peripheral_Latency Maximum Peripheral latency for the connection in
 *        number of connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for the LE Link. It shall be a
 *        multiple of 10 ms and larger than (1 + connPeripheralLatency) *
 *        connInterval * 2. Time = N * 10 msec.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @param Central_Clock_Accuracy Central clock accuracy. Only valid for a
 *        Peripheral.
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @param Advertising_Handle Used to identify an advertising set.
 * @param Sync_Handle Sync_Handle identifying the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 *        - 0xFFFF: No Sync_Handle
 * @retval None
 */

WEAK_FUNCTION(void hci_le_enhanced_connection_complete_v2_event(uint8_t Status,
                                                  uint16_t Connection_Handle,
                                                  uint8_t Role,
                                                  uint8_t Peer_Address_Type,
                                                  uint8_t Peer_Address[6],
                                                  uint8_t Local_Resolvable_Private_Address[6],
                                                  uint8_t Peer_Resolvable_Private_Address[6],
                                                  uint16_t Connection_Interval,
                                                  uint16_t Peripheral_Latency,
                                                  uint16_t Supervision_Timeout,
                                                  uint8_t Central_Clock_Accuracy,
                                                  uint8_t Advertising_Handle,
                                                  uint16_t Sync_Handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB_PRINTF("hci_le_enhanced_connection_complete_v2_event\r\n");
}
/**
 * @}
 */


